"""
Task:
1 - Свяжите переменную с любой строкой, состоящей не менее чем из 15 символов.
2 - Извлеките из строки первый символ
3 - Извлеките из строки последний символ
4 - Извлеките из строки третий с начала
5 - Извлеките из строки третий с конца
6 - Измерьте длину вашей строки
7 - Переверните строку
8 - Извлеките первые восемь символов
"""

STRING = 'qweasdzxc2390polina'
print(STRING[0])
print(STRING[-1])
print(STRING[2])
print(STRING[-3])
print(len(STRING))
print(STRING[::-1])
print(STRING[:8])
